Revit 2026 API
Curve.Intersect Method
Calculates the intersection of this curve with the specified curve.
Overload List
Name | Description
Intersect(Curve) | Obsolete.
Calculates the intersection of this curve with the specified curve.
Intersect(Curve, CurveIntersectResultOption) | Calculates the intersection of this curve with the specified curve.
Intersect(Curve, IntersectionResultArray) | Obsolete.
Calculates the intersection of this curve with the specified curve and returns the intersection results.
Top
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace